Ran Plan for 3 projects:

1. project: `test_server/staging/us-east-1` dir: `test_server/staging/us-east-1` workspace: `default`
1. project: `test_server/staging/global` dir: `test_server/staging/global` workspace: `default`
1. project: `test_server/deploy_testing/us-east-1` dir: `test_server/deploy_testing/us-east-1` workspace: `default`

### 1. project: `test_server/staging/us-east-1` dir: `test_server/staging/us-east-1` workspace: `default`
```diff
aws_instance.staging-web: Refreshing state... [id=i-07b9fedd8a2a02509]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p test_server/staging/us-east-1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-34-227-177-209.compute-1.amazonaws.com:4141/lock?id=sza12%252Fatlantis-example%252Ftest_server%252Fstaging%252Fus-east-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p test_server/staging/us-east-1`

---
### 2. project: `test_server/staging/global` dir: `test_server/staging/global` workspace: `default`
<details><summary>Show Output</summary>

```diff
aws_iam_role.test_role1: Refreshing state... [id=test_role1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.server.aws_iam_role.test_role2 will be created
+ resource "aws_iam_role" "test_role2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p test_server/staging/global`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-34-227-177-209.compute-1.amazonaws.com:4141/lock?id=sza12%252Fatlantis-example%252Ftest_server%252Fstaging%252Fglobal%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p test_server/staging/global`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. project: `test_server/deploy_testing/us-east-1` dir: `test_server/deploy_testing/us-east-1` workspace: `default`
**Plan Error**
```
running "/usr/bin/terraform init -input=false -upgrade" in "/root/.atlantis/repos/sza12/atlantis-example/18/default/test_server/deploy_testing/us-east-1": exit status 1
Upgrading modules...
- server in ../../modules/server

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Error refreshing state: AccessDenied: Access Denied
	status code: 403, request id: WSAZHWQ57TC22JMT, host id: V7ZzYqBBrIGckn0mTteX13CJKNhLjPVCQWhuENko1D7cYyfIcqvfJ+prDsNoHDHA1eKnoHpRQ0c=

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
